const sDumi = require('./index').sDumi;

test('sDumi: 123.12', () => {
    expect(sDumi(123.12)).toBe("Сто двадесет и три лв. и 12 ст.");
});

test('sDumi: 100123.00', () => {
    expect(sDumi(100123)).toBe("Сто хиляди сто двадесет и три лв. и 00 ст.");
});

test('sDumi: 2342892429.24 / fraction part rounding', () => {
    expect(sDumi(2342892429.24)).toBe("Два милиарда триста четиридесет и два милиона осемстотин деветдесет и две хиляди четиристотин двадесет и девет лв. и 24 ст.");
});

test('sDumi: 31.33', () => {
    expect(sDumi(31.33)).toBe("Тридесет и един лв. и 33 ст.");
});

test('sDumi: 120.83', () => {
    expect(sDumi(120.83)).toBe("Сто и двадесет лв. и 83 ст.");
});

test('sDumi: 710.63', () => {
    expect(sDumi(710.63)).toBe("Седемстотин и десет лв. и 63 ст.");
});

test('sDumi: 1000.99 / една хиляда!', () => {
    expect(sDumi(1000.99)).toBe("Хиляда лв. и 99 ст.");
});

test('sDumi: 0.00', () => {
    expect(sDumi(0)).toBe("Нула лв. и 00 ст.");
});

test('sDumi: 21000.21', () => {
    expect(sDumi(21000.21)).toBe("Двадесет и една хиляди лв. и 21 ст.");
});

test('sDumi: -100020.20', () => {
    expect(sDumi(-100020.20)).toBe("Минус сто хиляди и двадесет лв. и 20 ст.");
});
